Ruby on Rails/cwiczenie2/app/views/articles/new.html.erb

SELECT "users".* FROM "users"
---
 <%= f.label :user_id, "Author" %><br />
 <%= f.collection_select :user_id, User.all, :id, :login %>