Ruby on Rails/cwiczenie2/app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."published" = ? LIMIT ?  [["published", "t"], ["LIMIT", 1]]
---
  def index
  @articles = Article.where(published:true)

INSERT INTO "articles" ("title", "body", "user_id", "published", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "kgsdo"], ["body", "jgdaaa"], ["user_id", 1], ["published", "f"], ["created_at", "2017-06-17 18:55:21.784262"], ["updated_at", "2017-06-17 18:55:21.784262"]]
---
   def create
   @article = Article.new(article_params)

   if @article.save